FoamYade_lambda_box_lambdaDotModel/0_org/nParicles
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.org";
    object      nParticles;
}

// * if there is a particle in the cell it will receive value 1 if not, 0 * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    y1
    {
        type            calculated;
        value           uniform 0;
    }
    y0
    {
        type            calculated;
        value           uniform 0;
    }
    x0
    {
        type            cyclic;
    }
    x1
    {
        type            cyclic;
    }
    z0
    {
        type            cyclic;
    }
    z1
    {
        type            cyclic;
    }
    procBoundary0to1
    {
        type            processor;
        value           uniform 0;
    }
}

// ************************************************************************* //

