FoamYade_lambda_box_lambdaDotModel/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 2;

method          simple;
//strategies
//{
//  
//  optional
//
//}

simpleCoeffs
{
    n               (1 2 1);
    delta           0.001;
}
//
//hierarchicalCoeffs
//{
//    n               (1 1 1);
//    delta           0.001;
//    order           xyz;
//}
//
//manualCoeffs
//{
//    dataFile        "";
//}

distributed     no;

roots           ( );


// ************************************************************************* //
